In [1]:
import pandas as pd 
import numpy as np

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## yukarıda pandas kütüphanesini kullanarak ve onun içindeki Series() kullanarak seri oluşturduk bitane

In [4]:
data = np.array([10,20,30,40,50])

In [5]:
series = pd.Series(data , index = [100,101,102,103,104])

In [6]:
series

100    10
101    20
102    30
103    40
104    50
dtype: int32

In [7]:
## yukarıda oluşturdğumuz serirnin başındaki index no larını değiştirdik

In [8]:
data_1 = {"a" : 1 , "b" : 2 , "c" : 3}

In [9]:
series_1 = pd.Series(data_1)

In [11]:
series_1

a    1
b    2
c    3
dtype: int64

In [12]:
## yukarıda sözlüğü seri ye çevirdik

In [13]:
series_1[0]

1

In [15]:
series_1[0:1]

a    1
dtype: int64

In [16]:
## yukarıda serideki elemanlara eriştik

In [19]:

series_1["a"]

1

In [21]:
series_1[["a","b"]]

a    1
b    2
dtype: int64

In [22]:
## yukarıda serideki istediğimiz elemanlara eriştik

In [23]:
series_1["a":"c"]

a    1
b    2
c    3
dtype: int64

In [24]:
## bu komut ilede belli bi aralıktaki değerleri bulabiliriz

In [26]:
series_1["a"] = 90

In [27]:
series_1

a    90
b     2
c     3
dtype: int64

In [28]:
## yukarıda seri nin içindeki bi elemanı değiştirkd oyeee

In [29]:
series_1.sum()

95

In [30]:
series_1.max()

90

In [31]:
## series_1.max() ile serideki en büyük değeri aldık sum() ilede tüm değerleri topladık

In [32]:
names = [ "Hawking" , "Tesla" , "Turing"]

In [34]:
result = pd.DataFrame(names , columns = ["Names"])

In [35]:
result

     Names
0  Hawking
1    Tesla
2   Turing

In [36]:
## yukarıda yaptığımız bi listeyi tablo yaptık

In [46]:
hey = {"name" : ["Einstein" , "Hawking" , "Turing" , "Tesla"],
                   "Iq" : [300 , 301 , 302 , 303 ]}

In [47]:
hey

{'name': ['Einstein', 'Hawking', 'Turing', 'Tesla'],
 'Iq': [300, 301, 302, 303]}

In [50]:
result_1 = pd.DataFrame(hey,index = [1,2,3,4])

In [51]:
result_1

       name   Iq
1  Einstein  300
2   Hawking  301
3    Turing  302
4     Tesla  303

In [52]:
## yukarıda sözlüğü data frame çevirdik heyyyo

In [55]:
result_1["what are they from"] = pd.Series(["germany" , "italion" , "english" , "germany"],index = [1,2,3,4] )

In [56]:
result_1

       name   Iq what are they from
1  Einstein  300            germany
2   Hawking  301            italion
3    Turing  302            english
4     Tesla  303            germany

In [57]:
## yukarıda yaptığımız data table ye yeni bi sütun ekledik şimdide silmeye bakalı

In [58]:
result_1.drop("what are they from", axis = 1, inplace = True)

In [60]:
result_1

       name   Iq
1  Einstein  300
2   Hawking  301
3    Turing  302
4     Tesla  303

In [61]:
## yukarda yaptığımız işlem silme işlemiydi sütunu silmek için axis=1 dedik ve bu silme işleminin kalıcı olması için ise
## inplace = True dedik

In [62]:
result_1.drop(1,axis = 0,inplace = True)

In [63]:
result_1

      name   Iq
2  Hawking  301
3   Turing  302
4    Tesla  303

In [64]:
## yukarıdada satır silmek için bişeler yaptık bu sefer silmek istediğimiz indexi girdik sonra axis=0 dedik sonra kalıcı olması 
## için ise inplace =  True dedik

In [66]:
result_1.loc["2":"4"]

      name   Iq
2  Hawking  301
3   Turing  302
4    Tesla  303

In [67]:
## loc komutu bize girdiğimiz index lerdeki satırları gösterir

In [72]:
result_1.iloc[1:2]

     name   Iq
3  Turing  302

In [73]:
## yukarıda yazdığımız iloc ise bizim belirlediğimiz index no larına bakmadan normal olan 0 ,1 , 2 gibi belirlenen index nolarına
## göre çalışır ve bişeler yaparız

In [84]:
result_2 = {"name": ["ali","veli","kali","stephen","george","jane","judy"] ,"mat":[90,100,85,100,89,80,78],
            "fizik": [80,67,45,100,55,78,67], 
            "kimya":[60,70,80,100,90,78,90]}

In [87]:
result_3 = pd.DataFrame(result_2,index = [1,2,3,4,5,6,7])

In [88]:
result_3

      name  mat  fizik  kimya
1      ali   90     80     60
2     veli  100     67     70
3     kali   85     45     80
4  stephen  100    100    100
5   george   89     55     90
6     jane   80     78     78
7     judy   78     67     90

In [90]:
result_3["fizik"].min()

45

In [91]:
result_3["fizik"].max()

100

In [92]:
result_3["fizik"].mean()

70.28571428571429

In [93]:
result_3["fizik"].sum()

492

In [94]:
## yukarıdaki gibi işlemlerle bişeler hesaplayabilirz

In [95]:
result_3.describe()

              mat       fizik       kimya
count    7.000000    7.000000    7.000000
mean    88.857143   70.285714   81.142857
std      8.764104   17.941705   13.508375
min     78.000000   45.000000   60.000000
25%     82.500000   61.000000   74.000000
50%     89.000000   67.000000   80.000000
75%     95.000000   79.000000   90.000000
max    100.000000  100.000000  100.000000

In [96]:
## describe() metodu ile bu işlemlerin hepsini direk görebiliriz

In [98]:
result_3[result_3.mat > 90] ["name"]

2       veli
4    stephen
Name: name, dtype: object

In [99]:
## yukarıda koşul bildiren şeyler çağırdık